In [36]:
import pandas as pd
df = pd.read_excel('../z20_data/score.xlsx',index_col='지원번호')
df

       이름   학교  학년    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고   3  197   90   85  100  95  85      Python
2번    강태원  구로고   3  184   40   35   50  55  25        Java
3번    강호림  구로고   2  168   80   75   70  80  75  javascript
4번    김수찬  구로고   1  187   40   60   70  75  80         NaN
5번    김재욱  구로고   1  188   15   20   10  35  10         NaN
6번    박동현  단지고   3  202   80  100   95  85  80           C
7번    박혜정  단지고   2  188   55   65   45  40  35      PYTHON
8번    승근열  단지고   2  190  100   85   90  95  95          c#

# groupby - 그룹화

In [7]:
#groupby - 그룹화
# 학교 - 구로고, 단지고
df.groupby('학교')

In [5]:
# df.groupby('학교').get_group('구로고')
df.groupby('학교').get_group('단지고')

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    박동현  단지고  202   80  100  95  85  80       C
7번    박혜정  단지고  188   55   65  45  40  35  PYTHON
8번    승근열  단지고  190  100   85  90  95  95      c#

In [9]:
# size 학교별 학생수
df.groupby('학교').size()

학교
구로고    5
단지고    3
dtype: int64

In [12]:
# df.groupby('학교').size()['구로고']
df.groupby('학교').size()['단지고']

3

In [14]:
# 컬럼 전체의 키 평균
df['키'].mean()

188.0

In [13]:
df.groupby('학교')['키'].mean()

학교
구로고    184.800000
단지고    193.333333
Name: 키, dtype: float64

In [20]:
# df.groupby('학교')[['키','국어','영어','수학','과학','사회']].mean()
df.groupby('학교')[['키','국어','영어','수학','과학','사회']].min()
df.groupby('학교')[['키','국어','영어','수학','과학','사회']].max()

       키   국어   영어   수학  과학  사회
학교
구로고  197   90   85  100  95  85
단지고  202  100  100   95  95  95

In [21]:
df['학년'] = [3,3,2,1,1,3,2,2]

In [23]:
cols = list(df.columns)

In [24]:
df = df[cols[0:2]+[cols[-1]]+cols[2:-1]]

In [30]:
df
## 파일저장
# df.to_csv('../z20_data/score.csv',encoding='utf-8-sig')
# df.to_csv('../z20_data/score.txt',encoding='utf-8')
# df.to_excel('../z20_data/score.xlsx')

In [44]:
import pandas as pd
df = pd.read_excel('../z20_data/score.xlsx',index_col='지원번호')
df

       이름   학교  학년    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고   3  197   90   85  100  95  85      Python
2번    강태원  구로고   3  184   40   35   50  55  25        Java
3번    강호림  구로고   2  168   80   75   70  80  75  javascript
4번    김수찬  구로고   1  187   40   60   70  75  80         NaN
5번    김재욱  구로고   1  188   15   20   10  35  10         NaN
6번    박동현  단지고   3  202   80  100   95  85  80           C
7번    박혜정  단지고   2  188   55   65   45  40  35      PYTHON
8번    승근열  단지고   2  190  100   85   90  95  95          c#

In [45]:
df.groupby('학교').size()

학교
구로고    5
단지고    3
dtype: int64

In [48]:
df.groupby('학교')['키'].mean()

학교
구로고    184.800000
단지고    193.333333
Name: 키, dtype: float64

In [47]:
# 학교별 학생수
df['학교'].value_counts()

학교
구로고    5
단지고    3
Name: count, dtype: int64

In [55]:
# 학교,학년별 키 평균 출력
df.groupby(['학교','학년'])['키'].mean()

학교   학년
구로고  1     187.5
     2     168.0
     3     190.5
단지고  2     189.0
     3     202.0
Name: 키, dtype: float64

In [49]:
# 학교,학년별 학생수 출력
df.groupby(['학교','학년']).size()

학교   학년
구로고  1     2
     2     1
     3     2
단지고  2     2
     3     1
dtype: int64

In [64]:
# 학교,학년별 합계 출력
df.groupby(['학교','학년']).sum()
df.groupby(['학교','학년']).count()
df.groupby(['학교','학년'])[['이름','SW특기']].count()
df.groupby(['학교','학년'])[['키','국어']].mean()

            키    국어
학교  학년
구로고 1   187.5  27.5
    2   168.0  80.0
    3   190.5  65.0
단지고 2   189.0  77.5
    3   202.0  80.0

In [69]:
df.groupby('학교').get_group('구로고')

       이름   학교  학년    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고   3  197  90  85  100  95  85      Python
2번    강태원  구로고   3  184  40  35   50  55  25        Java
3번    강호림  구로고   2  168  80  75   70  80  75  javascript
4번    김수찬  구로고   1  187  40  60   70  75  80         NaN
5번    김재욱  구로고   1  188  15  20   10  35  10         NaN

In [75]:
df[['학교','학년']].value_counts()

school = df.groupby('학교')
school['학년'].value_counts()

학교   학년
구로고  1     2
     3     2
     2     1
단지고  2     2
     3     1
Name: count, dtype: int64

In [72]:
df.groupby(['학교','학년']).size()

학교   학년
구로고  1     2
     2     1
     3     2
단지고  2     2
     3     1
dtype: int64

In [78]:
df.groupby('학교').size()

학교
구로고    5
단지고    3
dtype: int64

In [79]:
school = df.groupby('학교')
school['학년'].value_counts().loc['구로고']

학년
1    2
3    2
2    1
Name: count, dtype: int64

In [87]:
# 학년별 인원수
school['학년'].value_counts().loc['구로고']
# 학년별 퍼센트 - normalize=True 
(school['학년'].value_counts(normalize=True).loc['구로고']*100).astype(str)+'%'

학년
1    40.0%
3    40.0%
2    20.0%
Name: proportion, dtype: object

In [102]:
import pandas as pd
df = pd.read_csv('../z20_data/students.csv',index_col=0)
df

,id,pw,name,phone,email,address,gender,major,grade,hobby,ip_address
no,,,,,,,,,,,
1,Joelynn,6856,Paschke,726-935-7279,jpaschke0@time.com,460 Melby Avenue,F,science,2,run,197.125.170.29
2,Bambie,8439,Henriet,106-961-2837,bhenriet1@github.io,5682 School Road,F,machine,1,game,186.223.222.89
3,Orin,4720,Torresi,283-535-0981,otorresi2@vinaora.com,2341 Straubel Place,M,computer,3,run,103.111.108.9
4,Puff,8047,Gilvary,677-319-4536,pgilvary3@bbc.co.uk,5 Sheridan Street,M,computer,1,game,130.172.144.105
5,Godfree,5878,Gauchier,451-834-0498,ggauchier4@uiuc.edu,96 Northwestern Trail,M,computer,2,run,203.234.117.86
...,...,...,...,...,...,...,...,...,...,...,...
996,Wilburt,4365,Eyrl,551-729-0172,weyrlrn@ezinearticles.com,111 Gina Plaza,M,computer,4,book,117.93.125.71
997,Broddie,1444,Chalfant,961-627-7363,bchalfantro@reference.com,40 Porter Point,M,machine,2,golf,235.60.202.0
998,Baxter,3156,Peacham,349-596-4800,bpeachamrp@vimeo.com,245 Jay Park,M,science,1,run,81.100.120.84
999,Ignacio,2412,Vaneev,130-508-8945,ivaneevrq@is.gd,6566 Schmedeman Lane,M,science,4,game,176.141.113.21
1000,Wallache,2512,Bleas,702-366-1309,wbleasrr@youku.com,2776 Leroy Point,M,science,3,golf,120.241.197.141

In [89]:
# 성별로 인원수를 출력하시오.
df.groupby('gender').size()

gender
F    515
M    485
dtype: int64

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   object
 1   pw          1000 non-null   int64
 2   name        1000 non-null   object
 3   phone       1000 non-null   object
 4   email       1000 non-null   object
 5   address     1000 non-null   object
 6   gender      1000 non-null   object
 7   major       1000 non-null   object
 8   grade       1000 non-null   int64
 9   hobby       1000 non-null   object
 10  ip_address  1000 non-null   object
dtypes: int64(2), object(9)
memory usage: 93.8+ KB

In [97]:
# df.groupby('grade').size()
(df['grade'].value_counts(normalize=True)*100).astype(str) +'%'

grade
4    25.6%
1    24.9%
3    24.9%
2    24.6%
Name: proportion, dtype: object